data/Section 5/5.1/Clients/VM3_Intance1/rep3/output_C2_T1_W64_K6_R3.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       38237 ops,     372 (avg:     424) ops/sec, 1.32MB/sec (avg: 1.51MB/sec),  5.32 (avg:  4.69) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         212.43          ---          ---      4.49000       220.60
Gets         212.42      1274.53         0.00      4.89200      1326.12
Waits          0.00          ---          ---      0.00000          ---
Totals       424.85      1274.53         0.00      4.69100      1546.73


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.600         0.03
SET       1.700         0.20
SET       1.800         0.83
SET       1.900         2.46
SET       2.000         5.00
SET       2.100         8.52
SET       2.200        12.67
SET       2.300        16.99
SET       2.400        21.40
SET       2.500        25.42
SET       2.600        28.95
SET       2.700        32.00
SET       2.800        34.64
SET       2.900        37.17
SET       3.000        39.60
SET       3.100        41.63
SET       3.200        43.32
SET       3.300        44.83
SET       3.400        46.37
SET       3.500        47.84
SET       3.600        49.22
SET       3.700        50.49
SET       3.800        51.76
SET       3.900        52.93
SET       4.000        53.99
SET       4.100        55.04
SET       4.200        56.13
SET       4.300        57.23
SET       4.400        58.35
SET       4.500        59.30
SET       4.600        60.35
SET       4.700        61.31
SET       4.800        62.30
SET       4.900        63.36
SET       5.000        64.44
SET       5.100        65.59
SET       5.200        66.84
SET       5.300        68.07
SET       5.400        69.27
SET       5.500        70.53
SET       5.600        71.79
SET       5.700        72.90
SET       5.800        74.30
SET       5.900        75.68
SET       6.000        77.04
SET       6.100        78.50
SET       6.200        79.90
SET       6.300        81.19
SET       6.400        82.41
SET       6.500        83.59
SET       6.600        84.73
SET       6.700        85.66
SET       6.800        86.65
SET       6.900        87.45
SET       7.000        88.26
SET       7.100        88.92
SET       7.200        89.56
SET       7.300        90.10
SET       7.400        90.62
SET       7.500        91.13
SET       7.600        91.61
SET       7.700        91.99
SET       7.800        92.41
SET       7.900        92.73
SET       8.000        93.03
SET       8.100        93.28
SET       8.200        93.57
SET       8.300        93.80
SET       8.400        93.99
SET       8.500        94.26
SET       8.600        94.50
SET       8.700        94.68
SET       8.800        94.93
SET       8.900        95.11
SET       9.000        95.28
SET       9.100        95.42
SET       9.200        95.72
SET       9.300        95.95
SET       9.400        96.20
SET       9.500        96.42
SET       9.600        96.58
SET       9.700        96.74
SET       9.800        96.90
SET       9.900        97.02
SET      10.000        97.66
SET      11.000        98.29
SET      12.000        98.63
SET      13.000        98.93
SET      14.000        99.21
SET      15.000        99.37
SET      16.000        99.46
SET      17.000        99.57
SET      18.000        99.65
SET      19.000        99.71
SET      20.000        99.76
SET      21.000        99.80
SET      22.000        99.84
SET      23.000        99.88
SET      24.000        99.90
SET      25.000        99.93
SET      26.000        99.94
SET      27.000        99.95
SET      30.000        99.96
SET      33.000        99.97
SET      34.000        99.98
SET      36.000        99.99
SET      44.000        99.99
SET      47.000       100.00
---
GET       1.900         0.01
GET       2.000         0.14
GET       2.100         0.59
GET       2.200         1.71
GET       2.300         3.87
GET       2.400         6.76
GET       2.500        10.38
GET       2.600        14.50
GET       2.700        18.66
GET       2.800        22.67
GET       2.900        26.44
GET       3.000        29.87
GET       3.100        33.10
GET       3.200        35.96
GET       3.300        38.50
GET       3.400        40.74
GET       3.500        42.72
GET       3.600        44.51
GET       3.700        46.30
GET       3.800        47.70
GET       3.900        49.05
GET       4.000        50.25
GET       4.100        51.33
GET       4.200        52.33
GET       4.300        53.26
GET       4.400        54.18
GET       4.500        55.12
GET       4.600        55.87
GET       4.700        56.80
GET       4.800        57.84
GET       4.900        58.89
GET       5.000        59.96
GET       5.100        61.02
GET       5.200        62.05
GET       5.300        63.28
GET       5.400        64.59
GET       5.500        65.89
GET       5.600        67.06
GET       5.700        68.37
GET       5.800        69.75
GET       5.900        71.14
GET       6.000        72.40
GET       6.100        73.82
GET       6.200        75.12
GET       6.300        76.52
GET       6.400        77.97
GET       6.500        79.26
GET       6.600        80.65
GET       6.700        81.76
GET       6.800        83.02
GET       6.900        84.21
GET       7.000        85.18
GET       7.100        86.09
GET       7.200        86.94
GET       7.300        87.72
GET       7.400        88.44
GET       7.500        89.09
GET       7.600        89.67
GET       7.700        90.19
GET       7.800        90.64
GET       7.900        91.08
GET       8.000        91.49
GET       8.100        91.91
GET       8.200        92.24
GET       8.300        92.55
GET       8.400        92.87
GET       8.500        93.14
GET       8.600        93.39
GET       8.700        93.66
GET       8.800        93.92
GET       8.900        94.12
GET       9.000        94.35
GET       9.100        94.59
GET       9.200        94.80
GET       9.300        95.01
GET       9.400        95.19
GET       9.500        95.37
GET       9.600        95.56
GET       9.700        95.72
GET       9.800        95.89
GET       9.900        96.12
GET      10.000        97.00
GET      11.000        98.00
GET      12.000        98.43
GET      13.000        98.69
GET      14.000        98.89
GET      15.000        99.10
GET      16.000        99.28
GET      17.000        99.39
GET      18.000        99.50
GET      19.000        99.56
GET      20.000        99.61
GET      21.000        99.68
GET      22.000        99.71
GET      23.000        99.78
GET      24.000        99.80
GET      25.000        99.82
GET      26.000        99.84
GET      27.000        99.86
GET      29.000        99.87
GET      30.000        99.88
GET      31.000        99.91
GET      32.000        99.92
GET      33.000        99.92
GET      34.000        99.93
GET      36.000        99.94
GET      38.000        99.94
GET      39.000        99.95
GET      40.000        99.96
GET      45.000        99.96
GET      49.000        99.97
GET      50.000        99.98
GET      59.000        99.98
GET      60.000        99.99
GET      70.000       100.00
---